[
    {
        "id": 1,
        "hasReminder": false,
        "name": "أذكار الصباح والمساء",
        "subNodes": [
            {
            "leafNode": {
                "value": " قراءة قل هو الله أحد والمعوذتين",
                "description": "تكفي من كل شيء"
            },
            "iteration": 3
        },
        {
            "leafNode": {
                "value": "اللهم عالم الغيب والشهادة، فاطر السموات والأرض رب كل شيء ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي ومن شر الشيطان وشركه) وأن أقترف على نفسي سوءًا أو أجره إلى مسلم))",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": " لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير",
                "description": ""
            },
            "iteration": 10
        },
        {
            "leafNode": {
                "value": "سبحان الله وبحمده",
                "description": ""
            },
            "iteration": 100
        },
        {
            "leafNode": {
                "value": "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم",
                "description": ""
            },
            "iteration": 3
        },
        {
            "leafNode": {
                "value": "اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك النشور",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء بذنبي فاغفر لي، فإنه لا يغفر الذنوب إلا أنت",
                "description": "من قالها من النهار موقنا بها فمات من يومه قبل أن يمسي فهو من أهل الجنة ومن قالها من الليل وهو موقنا بها فمات قبل أن يصبح فهو من أهل الجنة. ومعنى أبوء) أقر وأعترف وهذا سيد الاستغفار"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يدي ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي",
                "description": "يعني الخسف"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "أمسينا وأمسى الملك لله والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، رب أعوذ بك من الكسل وسوء الكبر، رب أعوذ بك من عذاب في النار وعذاب في القبر",
                "description": " وإذا أصبح قال: أصبحنا وأصبح الملك لله"
            },
            "iteration": 1
        }
        ],
        "isFavourite": false
    },
    {
        "id": 2,
        "hasReminder": false,
        "name": "الأذكار الخاصة بالصباح",
        "subNodes": [{
            "leafNode": {
                "value": "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير",
                "description": "في اليوم مائة مرة، كانت له عدل عشر رقاب، وكتبت له مائة حسنة ومحيت عنه مائة سيئة وكانت له حرزا من الشيطان يومه ذلك حتى يمسي"
            },
            "iteration": 100
        },
        {
            "leafNode": {
                "value": "أصبحنا على فطرة الإسلام وعلى كلمة الإخلاص وعلى دين نبينا محمد وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "سبحان الله وبحمده. عدد خلقه. ورضا نفسه. وزنة عرشه. ومداد كلماته",
                "description": ""
            },
            "iteration": 3
        }],
        "isFavourite": false
    },
    {
        "id": 3,
        "hasReminder": false,
        "name": "الأذكار الخاصة بالمساء",
        "subNodes": [{
            "leafNode": {
                "value": "أعوذ بكلمات الله التامات من شر ما خلق",
                "description": "أخرجه مسلم جـ17 ص31 ورواه الترمذي بلفظ من قال حين يمسي وحين يصبح ثلاث مرات أعوذ بكلمات الله التامات من شر ما خلق لم تضره حمة تلك الليلة) وقال حديث حسن."
            },
            "iteration": 3
        }],
        "isFavourite": false
    },
    {
        "id": 4,
        "hasReminder": false,
        "name": "أذكار عامة",
        "subNodes": [{
            "leafNode": {
                "value": "سبحان الله والحمد لله ولا إله إلا الله والله أكب",
                "description": "من قال: «سبحان الله وبحمده» مائة مرة حطت خطاياه وإن كانت مثل زبد البحر"
            },
            "iteration": 100
        }],
        "isFavourite": false
    },
    {
        "id": 5,
        "hasReminder": false,
        "name": "أذكار النوم",
        "subNodes": [{
            "leafNode": {
                "value": "عن عائشة رضي الله تعالى عنها أن النبي  كان إذا أوى إلى فراشه كل ليلة جمع كفيه ثم نفث فيهما فقرأ فيهما قل هو الله أحد) وقل أعوذ برب الفلق) وقل أعوذ برب الناس) ثم يمسح بهما ما استطاع من جسده يبدأ بهما على رأسه ووجهه وما أقبل من جسده يفعل ذلك ثلاث مرات",
                "description": ""
            },
            "iteration": 3
        },
        {
            "leafNode": {
                "value": "الله أكبر",
                "description": ""
            },
            "iteration": 34
        },
        {
            "leafNode": {
                "value": "الحمد لله",
                "description": ""
            },
            "iteration": 33
        },
        {
            "leafNode": {
                "value": "سبحان الله",
                "description": ""
            },
            "iteration": 33
        },
        {
            "leafNode": {
                "value": " قال النبي : «من قرأ الآيتين من آخر سورة البقرة في ليلة كفتاه» رواه البخاري ومسلم",
                "description": "أي كفتاه شر ما يؤذيه وهما قوله تعالى:آمن الرسول بما أنزل إليه من ربه والمؤمنون...) الخ السورة"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "اللهم قني عذابك يوم تبعث عبادك",
                "description": ""
            },
            "iteration": 3
        },
        {
            "leafNode": {
                "value": "الحمد لله الذي أطعمنا وسقانا وكفانا وآوانا فكم ممن لا كافي له ولا مؤوي",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "اللهم خلقت نفسي وأنت تتوفاها لك مماتها ومحياها إن أحييتها فاحفظها وإن أمتها فاغفر لها اللهم إني أسألك العافية",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "قراءة آية الكرسي. من قرأها لا يزال عليه من الله حافظ ولا يقربه شيطان حتى يصبح",
                "description": "وهي الله لا إله إلا هو الحي القيوم) الآية 255 من سورة البقرة."
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "عن البراء بن عازب رضي الله عنهما قال: قال لي رسول الله: «إذا أتيت مضجعك فتوضأ وضوءك للصلاة ثم اضطجع على شقك الأيمن وقال: اللهم أسلمت نفسي إليك وفوضت أمري إليك وألجأت ظهري إليك رغبة ورهبة إليك لا ملجأ ولا منجا منك إلا إليك آمنت بكتابك الذي أنزلت وبنبيك الذي أرسلت، فإن مت، مت على الفطرة، واجعلهن آخر ما تقول»",
                "description": "وفي رواية للبخاري وإن أصبحت أصبت خيرا.ويقرأ سورة قل يا أيها الكافرون) فإنها براءة من الشرك "
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 5,
        "hasReminder": false,
        "name": "بعض الآداب عند النوم",
        "subNodes": [{
            "leafNode": {
                "value": "عن عائشة رضي الله عنها قالت: «كان النبي إذا أراد أن ينام وهو جنب غسل فرجه وتوضأ للصلاة»",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "لا تتركوا النار في بيوتكم حين تنامون",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 6,
        "hasReminder": false,
        "name": "إذا رأى في منامه ما يحب",
        "subNodes": [{
            "leafNode": {
                "value": " يعرف أن ذلك بشرى من الله تعالى",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "يحمد الله تعالى عليها",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": " يُحَدِّثُ بها من يحب",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 7,
        "hasReminder": false,
        "name": "إذا رأى ما يكره في منامه",
        "subNodes": [{
            "leafNode": {
                "value": "يستعيذ بالله من شرها  يستعيذ بالله من شر الشيطان  لا يحدث بها أحدًا  يتفل عن يساره ثلاثًا  يصلي  وإذا أراد أن يعود إلى النوم فليتحول عن الجنب الذي كان عليه  فإنها لا تضره",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 8,
        "hasReminder": false,
        "name": "ما يقول إذا استيقظ",
        "subNodes": [{
            "leafNode": {
                "value": "عن عبادة بن الصامت رضي الله تعالى عنه عن النبي قال: «من تعار) من الليل فقال: لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير. الحمد لله وسبحان الله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله».ثم قال: «اللهم اغفر لي أو دعا استجيب له فإن توضأ وصلى قبلت صلاته»",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "الحمد لله الذي أحيانا بعدما أماتنا وإليه النشور",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "الحمد لله الذي رد علي روحي وعافاني في جسدي وأذن لي بذكره",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "إذا استيقظ أحدكم من نومه فلا يدخل يده في الإناء حتى يغسلها ثلاثًا فإن أحدكم لا يدري أين باتت يده",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "إذا استيقظ أحدكم من منامه فتوضأ فليستنثر ثلاث مرات فإن الشيطان يبيت على خياشيمه",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 10,
        "hasReminder": false,
        "name": "ما يقول عند دخول الخلاء",
        "subNodes": [{
            "leafNode": {
                "value": "بسم الله)، اللهم إني أعوذ بك من الخبث والخبائث",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 11,
        "hasReminder": false,
        "name": "عند الخروج من الخلاء",
        "subNodes": [{
            "leafNode": {
                "value": "غفرانك",
                "description": ""
            },
            "iteration": 3
        }],
        "isFavourite": false
    },
    {
        "id": 12,
        "hasReminder": false,
        "name": "عند الوضوء",
        "subNodes": [{
            "leafNode": {
                "value": "«بسم الله» رواه مسلم وغيره كما في الوابل الصيب ص286",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 13,
        "hasReminder": false,
        "name": "عند الفراغ من الوضوء",
        "subNodes": [{
            "leafNode": {
                "value": "أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدًا عبده ورسوله) اللهم اجعلني من التوابين واجعلني من المتطهرين",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 14,
        "hasReminder": false,
        "name": "عند سماع الأذان",
        "subNodes": [{
            "leafNode": {
                "value": "يقول كما يقول المؤذن) ويقول عند الحيعلتين: «لا حول ولا قوة إلا بالله») ثم يقول: «اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدًا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته»",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 15,
        "hasReminder": false,
        "name": "عند دخول المسجد",
        "subNodes": [{
            "leafNode": {
                "value": " يسلم على النبي  ثم يقول: «اللهم افتح لي أبواب رحمتك»",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "فائدة)خمس سنن عن رسول الله  في إجابة المؤذن:أحدها: الصلاة عليه .الثانية: أن يقول مثل ما يقول المؤذن).الثالثة: أن يدعو له  بالوسيلة والفضيلة والمقام المحمود.والرابعة: أن يقول: «رضيت بالله ربا وبالإسلام دينا وبمحمد رسولا»).والخامسة: أن يدعو الله بعد إجابة المؤذن وصلاته على رسوله وسؤاله له الوسيلة، فإن الدعاء لا يرد بين الأذان والإقامة).فهذه خمسة وعشرون سنة في اليوم والليلة لا يحافظ عليها إلا السابقون"
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 16,
        "hasReminder": false,
        "name": "ما يقال في الركوع",
        "subNodes": [{
            "leafNode": {
                "value": "سبحان ربي العظيم) سبحان ربي العظيم وبحمده",
                "description": ""
            },
            "iteration": 3
        },
        {
            "leafNode": {
                "value": "سبحانك اللهم ربنا وبحمدك اللهم اغفر لي",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "سبوح قدوس رب الملائكة والروح",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 17,
        "hasReminder": false,
        "name": "ما يقال بعد الرفع من الركوع",
        "subNodes": [{
            "leafNode": {
                "value": "ربنا) لك الحمد ملء السموات والأرض وملء ما شئت من شيء بعد أهل الثناء والمجد أحق ما قال العبد وكلنا لك عبد اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 18,
        "hasReminder": false,
        "name": "ما يقال في السجود",
        "subNodes": [{
            "leafNode": {
                "value": "سبحانك اللهم ربنا وبحمدك اللهم اغفر لي",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "سبحان ربي الأعلى",
                "description": ""
            },
            "iteration": 3
        },
        {
            "leafNode": {
                "value": "سبوح قدوس رب الملائكة والروح",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "اللهم اغفر لي ذنبي كله دقه وجله وأوله وآخره وعلانيته وسره",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "اللهم أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 19,
        "hasReminder": false,
        "name": "ما يقال بين السجدتين",
        "subNodes": [{
            "leafNode": {
                "value": "رب اغفر لي رب اغفر لي",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "اللهم اغفر لي وارحمني واجبرني) واهدني وارزقني",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 20,
        "hasReminder": false,
        "name": "ما يقال بعد التشهد",
        "subNodes": [{
            "leafNode": {
                "value": "اللهم إني أعوذ بك من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن فتنة المسيح الدجال",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value":"اللهم إني ظلمت نفسي ظلمًا كثيرًا ولا يغفر الذنوب إلا أنت فاغفر لي مغفرة من عندك وارحمني إنك أنت الغفور الرحيم ",
                "description": ""
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": " اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أسرفت وما أنت أعلم به مني أنت المقدم وأنت المؤخر لا إله إلا أنت",
                "description": "رواه ابن ماجة والنسائي والحاكم وقال صحيح على شرط الشيخين ووافقه الذهبيوفي لفظ: وعافني - بدل - واجبرنيأبو داود والترمذي وابن ماجة والحاكم وصححه ووافقه الذهبيرواه مسلم 5/87 وأبو داود 1/60رواه البخاري ومسلم"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "فائدة",
                "description": "(المواضع التي كان النبي r يدعو فيها في الصلاة، سبعة مواطن)() \nأحدها: بعد تكبيرة الإحرام في محل الاستفتاح \nالثاني: قبل الركوع وبعد الفراغ من القراءة في الوتر() والقنوت العارض في الصبح قبل الركوع إن صح ذلك، فإن فيه نظرًا \nالثالث: بعد الاعتدال من الركوع، كما ثبت ذلك في «صحيح مسلم» من حديث عبد الله بن أبي أوفى: كان رسول الله r إذا رفع رأسه من الركوع قال: «سمع الله لمن حمده، اللهم ربنا لك الحمد ملء السموات، وملء الأرض، وملء ما شئت من شيء بعد، اللهم طهرني بالثلج والبرد والماء البارد، اللهم طهرني من الذنوب والخطايا كما ينقى الثوب الأبيض من الوسخ»() \nالرابع: في ركوعه كان يقول: «سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي»() \nالخامس: في سجوده، وكان فيه غالب دعائه \nالسادس: بين السجدتين \nالسابع: بعد التشهد وقبل السلام، وبذلك أمر في حديث أبي هريرة() \n وحديث فضالة بن عبيد() وأمر أيضا بالدعاء في السجود \nوأما الدعاء بعد السلام من الصلاة مستقبل القبلة أو المأمومين، فلم يكن ذلك من هديه r أصلاً، ولا روي عنه بإسناد صحيح،ولا حسن \nوأما تخصيص ذلك بصلاتي الفجر والعصر، فلم يفعل ذلك هو ولا أحد من خلفائه، ولا أرشد إليه أمته، وإنما هو استحسان رآه من رآه عوضًا من السنة بعدهما، والله أعلم \n وعامة الأدعية، المتعلقة بالصلاة إنما فعلها فيها \n"
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 21,
        "hasReminder": false,
        "name": "ما يقال بعد السلام من الصلاة",
        "subNodes": [{
            "leafNode": {
                "value": "أستغفر الله، أستغفر الله، أستغفر الله. اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام",
                "description": "مسلم 1/414"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير، اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد",
                "description": "البخاري 2/325 ومسلم 1/415"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير، لا حول ولا قوة إلا بالله، لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل وله الثناء الحسن لا إله إلا الله مخلصين له الدين ولو كره الكافرون",
                "description": "مسلم 1/415 - 416"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "سبحان الله",
                "description": ""
            },
            "iteration": 33
        },
        {
            "leafNode": {
                "value": "الحمد لله",
                "description": ""
            },
            "iteration": 33
        },
        {
            "leafNode": {
                "value": "الله أكبر",
                "description": ""
            },
            "iteration": 33
        },
        {
            "leafNode": {
                "value": "لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير",
                "description": "مسلم 1/418"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "اللهم أعني على ذكرك وشكرك وحسن عبادتك",
                "description": "أبو داود وابن خزيمة في صحيحيهما وقال الحاكم صحيح على شرط الشيخين"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "اللهم إني أعوذ بك من الجبن وأعوذ بك أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وأعوذ بك من عذاب القبر",
                "description": " البخاري 6/35"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "قراءة آية الكرسي:}اللهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلا بِإِذْنِهِ يَعْلَمُمَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ{",
                "description": "النسائي وصححه ابن حبان والحاكم (انظر: تحفة الذاكرين للشوكاني ص: 117)"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "قراءة المعوذتين \nبسم الله الرحمن الرحيم\n}قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ{ \n\nبسم الله الرحمن الرحيم\n}قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ{",
                "description": "أبو داود 2/181 والنسائي 3/68 والترمذي 8/215 وصححه ابن حبان والحاكم"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "اللهم إني أعوذ بك من الكفر والفقر وعذاب القبر",
                "description": "النسائي 8/230 وابن السني صفحة رقم 109 وهو حديث حسن"
            },
            "iteration": 1
        },
        {
            "leafNode": {
                "value": "ملاحظة",
                "description": "أخي المسلم حافظ على هذه الأذكار بعد كل صلاة ليحفظك الله بها وفقك الله لكل خير وحفظك من كل سوء وجعلك مباركًا أينما كنت وأعانك على ذكره وشكره وحسن عبادت "
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 22,
        "hasReminder": false,
        "name": "ما يقول في المسجد",
        "subNodes": [{
            "leafNode": {
                "value": "يستحب الإكثار فيه من ذكر الله تعالى والتسبيح والتهليل والتحميد والتكبير وغيرها من الأذكار، ويستحب فيه قراءة حديث رسول الله r وعلم الفقه وسائر العلوم الشرعية\n قال الله تعالى \n}فِي بُيُوتٍ أَذِنَ اللهُ أَنْ تُرْفَعَ وَيُذْكَرَ فِيهَا اسْمُهُ يُسَبِّحُ لَهُ فِيهَا بِالْغُدُوِّ وَالآصَالِ * رِجَالٌ{\n الآية [النور: 35 \n\nوقال تعالى\n}وَمَنْ يُعَظِّمْ شَعَائِرَ اللهِ فَإِنَّهَا مِنْ تَقْوَى الْقُلُوبِ{\n الحج: 32 \n\nوقال تعالى\n}وَمَنْ يُعَظِّمْ حُرُمَاتِ اللهِ فَهُوَ خَيْرٌ لَهُ عِنْدَ رَبِّهِ{\n الحج: 30 \n\n وروينا عن بريدة   قال: قال رسول الله\nإنما بنيت المساجد لما بنيت له\n رواه مسلم في «صحيحه» \nوعن أنس  \n «أن رسول الله  قال للأعرابي الذي بال في المسجد \n إن هذه المساجد لا تصلح لشيء من هذا البول ولا القذر، إنما هي لذكر الله تعالى والصلاة وقراءة القرآن» رواه مسلم في صحيحه",
                "description": ""
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 22,
        "hasReminder": false,
        "name": "ما يقال عند الخروج من المسجد",
        "subNodes": [{
            "leafNode": {
                "value": "اللهم إني أسألك من فضلك",
                "description": "مسلم 5/224"
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 23,
        "hasReminder": false,
        "name": "ما يقال عند دخول المنزل",
        "subNodes": [{
            "leafNode": {
                "value": "اللهم إني أسألك خير المولج وخير المخرج، بسم الله ولجنا، وبسم الله خرجنا، بسم الله ولجنا، وبسم الله خرجنا، وعلى ربنا توكلنا.ثم يسلم على أهل ",
                "description": "أبو داود 5/328 وهو حديث حسن"
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 24,
        "hasReminder": false,
        "name": "ما يقال عند الخروج من المنزل",
        "subNodes": [{
            "leafNode": {
                "value": "بسم الله توكلت على الله اللهم إني أعوذ بك من أن أضل أو أضل أو أزل أو أزل أو أظلم أو أظلم أو أجهل أو يجهل علي",
                "description": "أبو داود 5/327 والترمذي تحفة 9/385. قال النووي في الأذكار ص18 حديث صحيح وصححه الترمذي"
            },
            "iteration": 1
        }],
        "isFavourite": false
    },
    {
        "id": 25,
        "hasReminder": false,
        "name": "ما يقال عند نزول المنزل",
        "subNodes": [{
            "leafNode": {
                "value": "أعوذ بكلمات الله التامات من شر ما خلق",
                "description": "من قال هذا لم يضره شيء حتى يرتحل من منزله ذلك\nمسلم 17 ص31"
            },
            "iteration": 1
        }],
        "isFavourite": false
    }
]
